In [80]:
import pandas as pd
import numpy as np
data=pd.read_csv('loan_data_set.csv')

In [71]:
data.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [68]:
data.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [51]:
data_crosstab = pd.crosstab(data['Married'], 
                            data['Loan_Status'])

In [52]:
data_crosstab

Loan_Status    N    Y
Married
No            79  134
Yes          113  285

In [53]:
data_crosstab = pd.crosstab(data['Education'], 
                            data['Loan_Status'],  
                               )

In [54]:
data_crosstab

Loan_Status     N    Y
Education
Graduate      140  340
Not Graduate   52   82

In [72]:
data_crosstab = pd.crosstab([data['Gender'],data['Education']], 
                            data['Loan_Status'],  
                               )

In [73]:
data_crosstab

Loan_Status            N    Y
Gender Education
Female Graduate       31   61
       Not Graduate    6   14
Male   Graduate      105  271
       Not Graduate   45   68

In [81]:
data_crosstab = pd.crosstab([data['Education'],data['Gender']], 
                            data['Loan_Status'],  
                               margins=True)

In [82]:
data_crosstab

Loan_Status            N    Y  All
Education    Gender
Graduate     Female   31   61   92
             Male    105  271  376
Not Graduate Female    6   14   20
             Male     45   68  113
All                  187  414  601

In [78]:
datainput=pd.read_csv('Iris.csv')
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [79]:
width_species = pd.crosstab(datainput['PetalWidthCm'],datainput['Species'],margins = False)
print(width_species)

Species       Iris-setosa  Iris-versicolor  Iris-virginica
PetalWidthCm
0.1                     6                0               0
0.2                    28                0               0
0.3                     7                0               0
0.4                     7                0               0
0.5                     1                0               0
0.6                     1                0               0
1.0                     0                7               0
1.1                     0                3               0
1.2                     0                5               0
1.3                     0               13               0
1.4                     0                7               1
1.5                     0               10               2
1.6                     0                3               1
1.7                     0                1               1
1.8                     0                1              11
1.9                     0                0               5
2.0                     0                0               6
2.1                     0                0               6
2.2                     0                0               3
2.3                     0                0               8
2.4                     0                0               3
2.5                     0                0               3

In [90]:
a = np.array(["foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar", "foo", "foo", "foo"], dtype=object)
b = np.array(["one", "one", "one", "two", "one", "one",  "one", "two", "two", "two", "one"], dtype=object)
c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny", "shiny", "dull", "shiny", "shiny", "shiny"],dtype=object)

In [91]:
a

array(['foo', 'foo', 'foo', 'foo', 'bar', 'bar', 'bar', 'bar', 'foo',
       'foo', 'foo'], dtype=object)

In [92]:
b

array(['one', 'one', 'one', 'two', 'one', 'one', 'one', 'two', 'two',
       'two', 'one'], dtype=object)

In [93]:
c

array(['dull', 'dull', 'shiny', 'dull', 'dull', 'shiny', 'shiny', 'dull',
       'shiny', 'shiny', 'shiny'], dtype=object)

In [94]:
len(a)

11

In [96]:
pd.crosstab(a, [b, c])

col_0  one        two
col_1 dull shiny dull shiny
row_0
bar      1     2    1     0
foo      2     2    1     2

In [102]:
 'Iris.csv'

/bin/sh: line 0: type: Iris.csv: not found